In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.DataFrame({'Name':['Robert','Monika','Mark','Alverado','Alan'],
                'Age':[28,41,np.nan,np.nan,38],
                'Experience':[np.nan,np.nan,24,np.nan,11],
                'Salary':['20K<30K','35K<45K','55K<65K','25K<35K','29K<39K']})

In [3]:
df

       Name   Age  Experience   Salary
0    Robert  28.0         NaN  20K<30K
1    Monika  41.0         NaN  35K<45K
2      Mark   NaN        24.0  55K<65K
3  Alverado   NaN         NaN  25K<35K
4      Alan  38.0        11.0  29K<39K

In [13]:
df.fillna(np.round(np.mean(df['Age'])))

       Name   Age  Experience   Salary
0    Robert  28.0        36.0  20K<30K
1    Monika  41.0        36.0  35K<45K
2      Mark  36.0        24.0  55K<65K
3  Alverado  36.0        36.0  25K<35K
4      Alan  38.0        11.0  29K<39K